[
    {
        "title" : "Miasma Chronicles",
        "id": "miasma",
        "filter": "professional-projects",
        "position" : "Generalist Programmer",
        "text" :
        {
            "p1" : "Miasma Chronicles is a tactical turnbased RPG game, and a spiritual successor to the critically aclaimed Mutant Year Zero. In the game you travel around with a party of characters, taking on quests and exploring in realtime, whilst encountering and fighting enemies in turnbased combat. The dynamic swithcing between realtime and turnbased gameplay in combination with the RPG-elements and systems made this project challenging but incredibly rewarding.",
            "p2" : "In the development of the game my responsibilities included gameplay programming, UI programming, API integration, optimization and more. Most of my time has been spent on UI programming, creating adaptable systems and working closely with our outsourced design team to bring their vision to life on the screen. This also allowed me to explore my creativity as I've gotten to design some of the elements and most of the UI animations myself.",
            "p3" : "Since the game was built for multiple platforms I've gained invaluable experience in working with platform specific API's, mainly for PC (where we launched on Steam, Epic Store and GOG) as well as the PlayStation 5. I have integrated achievements/trophies, as well as Activities on the PS5, but I also became very familiar with the full pipelines for each platform.",
            "p4" : "Code ownership has been an important part of my job during the project. I've learned to program expandable, flexible, and maintainable systems and how to integrate them into an already expansive code base."
        },
        "trailer" : "https://www.youtube.com/watch?v=VL9wrP3hUN0&t=4s",
        "website" : "https://miasmachronicles.com/",
        "quote" :
        {
            "text" : "Miasma Chronicles is one hell of a ride from start to finish. Although the package comes with a compelling story, my number one enjoyment was to find new ways to finish a fight faster since I treated these as puzzles with complex solutions. If you love turn-based games, Miasma Chronicles is a must-play.",
            "author" : "Softpedia",
            "author_title" : "Cosmin Vasile",
            "author_img" : "images/softpedia-logo.png"
        },
        "splash" : "images/miasma/miasma_header.jpg",
        "screenshots" :
        {
            "01" : "images/miasma/miasma_gameplay_4.jpg",
            "02" : "images/miasma/miasma_gameplay_5.jpg",
            "03" : "images/miasma/miasma_gameplay_1.jpg",
            "04" : "images/miasma/miasma_gameplay_2.jpg",
            "05" : "images/miasma/miasma_gameplay_6.jpg"
        },
        "specs" :
        {
            "duration" : "2 Years",
            "engine" : "Unreal Engine 4",
            "language" : "C++ & Blueprints",
            "platform" : "PC, PS5, Xbox Series X|S",
            "input" : "Gamepad, Mouse/Keyboard"
        }
        
    },
    {
        "title" : "Of The Sky",
        "id": "ofthesky",
        "filter": "student-games",
        "position" : "Lead Programmer & Technical Artist",
        "text" :
        {
            "p1" : "Of the Sky is a third person 3D exploration and puzzle solving game. It takes place in a floating island world inspired by the beautiful scenery found on the Swedish island of Gotland. Using the easy to understand mechanics, explore the many floating islands, solve puzzles, and try to uncover the mystery of the fire keeping the islands afloat in the sky! You play as Hymn, a mysterious spirit-like creature whose motives are unknown, but who you can’t help but want to help guide.",
            "p2" : "In the development of the game my responsibilities included gameplay programming, system building, animation programming, UI programming, aduio programming, shader programming, performance optimization and more. I also spent a lot of time working with the lighting and VFX.",
            "p3" : "Most of my time went into the gameplay programming and the game feel. I decided to code all of the animations in the game rather than having the artists animating their models, as it gave us much more flexibility. With the system I built, non-programmer members of the team could themselves go in and change the properties of the animations dynamically during gameplay to see what would fit the best. This saved us a lot of time on redoing animations and such.",
            "p4" : "Of the Sky was developed in 8 weeks as part of the vertical slice course at Uppsala University and was displayed at <a href='https://itch.io/jam/gotland-game-conference-2020/rate/627412' target='blank'>GGC 2020</a> where it placed second in presentation and level design, as well as top 10 in all other categories."
        },
        "trailer" : "https://www.youtube.com/watch?v=QUMXtxb2AQs",
        "website" : "https://unbookables.itch.io/of-the-sky",
        "quote" :
        {
            "text" : "All in all it looks, sounds and feels great. For the few weeks of this project, it's impressive to see what you were able to get together, and with this amount of polish that you had time to get in there as well.",
            "author" : "Joakim Enigk Sjöberg",
            "author_title" : "Technical Sound Designer at Hazelight",
            "author_img" : "images/joakim.jpg"
        },
        "splash" : "images/ofthesky/ofthesky_splash.jpg",
        "screenshots" :
        {
            "01" : "images/ofthesky/ofthesky_screen_01.jpg",
            "02" : "images/ofthesky/ofthesky_screen_02.jpg",
            "03" : "images/ofthesky/ofthesky_screen_03.jpg",
            "04" : "images/ofthesky/ofthesky_screen_04.jpg",
            "05" : "images/ofthesky/ofthesky_screen_05.jpg",
            "06" : "images/ofthesky/ofthesky_screen_06.jpg",
            "07" : "images/ofthesky/ofthesky_screen_07.jpg",
            "08" : "images/ofthesky/ofthesky_screen_08.jpg",
            "09" : "images/ofthesky/ofthesky_screen_09.jpg",
            "10" : "images/ofthesky/ofthesky_screen_10.jpg"
        },
        "specs" :
        {
            "duration" : "8 Weeks",
            "engine" : "Unreal Engine 4",
            "language" : "C++ & Blueprints",
            "platform" : "Windows 10",
            "input" : "Gamepad, Mouse/Keyboard"
        }
        
    },
    {
        "title" : "Colossal Chaos",
        "id": "cc",
        "filter": "student-games",
        "position" : "Lead Programmer",
        "text" :
        {
            "p1" : "A 3D destruction runner developed for the PC, where the player needs to save their village from a rampaging giant. The player jumps onto the shoulders of the giant and tries to steer the stampeding beast out of the village by twisting its head. Get ready for a dramatic ride filled with broken buildings, frightened farmers, and maybe a few crumbled cathedrals!",
            "p2" : "My responsibilities during the development mainly included gameplay programming, system building and performance optimization.",
            "p3" : "I spent a lot of time building and optimizing a destruction system where the giant would partially destroy buildings he would walk in to (as seen in the trailer). The system checks for structural points in each building and makes sure they are not all destroyed. If they are, the building completely collapses on itself. This prevents unnatural structures and floating pieces being left after the giant has partially destroyed the building.",
            "p4" : "Colossal Chaos was created in 8 weeks during the Arcade course at Uppsala University, and was displayed at GGC 2019 where is was nominated for best arcade game."
        },
        "trailer" : "https://www.youtube.com/watch?v=fWSdPTjQqAU",
        "website" : "https://colossalchaos.netlify.app/colossal%20chaos",
        "quote" :
        {
            "text" : "I love this idea! The giants walk cycle is priceless and the game looks pretty to. It’s stupid fun and you managed to build an input that enhances the experience and at the same time create a game that could stand for itself.",
            "author" : "Danielle Unéus",
            "author_title" : "COO & Producer at Eat Create Sleep",
            "author_img" : "images/danielle.jpg"
        },
        "splash" : "images/colossalchaos/colossalchaos_splash.jpg",
        "screenshots" :
        {
            "01" : "images/colossalchaos/colossalchaos_screen_01.jpg",
            "02" : "images/colossalchaos/colossalchaos_screen_02.jpg",
            "03" : "images/colossalchaos/colossalchaos_screen_03.jpg",
            "04" : "images/colossalchaos/colossalchaos_screen_04.jpg",
            "05" : "images/colossalchaos/colossalchaos_screen_05.jpg",
            "06" : "images/colossalchaos/colossalchaos_screen_06.jpg",
            "07" : "images/colossalchaos/colossalchaos_screen_07.jpg"
        },
        "specs" :
        {
            "duration" : "8 Weeks",
            "engine" : "Unity 3D",
            "language" : "C# (MonoBehaviour)",
            "platform" : "Windows 10",
            "input" : "Custom Built Giant Head"
        }
    },
    {
        "title" : "Static Level Generator for Unity3D",
        "id": "levelgen",
        "filter": "personal-projects",
        "text" :
        {
            "p1" : "This is my latest project, and what I am currently working on during my free time. It is a static level generator with a custom UI built in C# (.NET and MonoBehaviour) for Unity3D.",
            "p2" : "The API currently features vertical and horizontal generation, control over both induvidual cell and level transformation, custom rooms with many options, a custom easy-to-use UI, dynamic level caching for a good workflow between levels, and a lot more.",
            "p3" : "Once the project is in a releasable state, it will be put up on the Unity Asset Store. For a full (still work in progress) API-documentation, head over to the project git repo linked to the right."
        },
        "website" : "https://github.com/meNotLucky/GridLevelGenerator",
        "splash" : "images/levelgen/splash.png",
        "screenshots" :
        {
            "01" : "images/levelgen/screen_01.png",
            "02" : "images/levelgen/screen_02.png",
            "03" : "images/levelgen/screen_03.png"
        },
        "specs" :
        {
            "duration" : "Ongoing",
            "engine" : "Unity3D",
            "language" : "C# (.NET & MonoBehaviour)"
        }
    },
    {
        "title" : "Zelda in SDL",
        "id": "zelda",
        "filter": "personal-projects",
        "text" :
        {
            "p1" : "This is a school project from the first year of Game design and programming at Uppsala University. The specific course is Game Programming 1. It turned into a bigger project than I expected, but I had a lot of fun with it.",
            "p2" : "The task was to recreate a classic game in about a month, although since the assignement overlapped the holidays I only worked on it for about two weeks. All of the source code outside of SDL was written entirely by me. My goal was to create the first four levels of the original The Legend of Zelda game for the NES, including the starting cave where you retrieve the sword.",
            "p3" : "Further information about the project and development process can be found in the project github repo (linked to the right)."
        },
        "website" : "https://github.com/meNotLucky/Zelda-in-SDL",
        "splash" : "images/zelda/splash.png",
        "screenshots" :
        {
            "01" : "images/zelda/screen_01.png",
            "02" : "images/zelda/screen_02.png",
            "03" : "images/zelda/screen_03.png",
            "04" : "images/zelda/screen_04.png",
            "05" : "images/zelda/screen_05.png"
        },
        "specs" :
        {
            "duration" : "2 Weeks",
            "engine" : "SDL2",
            "language" : "C++",
            "platform" : "Windows 10",
            "input" : "Keyboard"
        }
    },
    {
        "title" : "ScheduleBone Discord Bot",
        "id": "schedulebone",
        "filter": "personal-projects",
        "text" :
        {
            "p1" : "This is a discord bot I made in my spare time. At first, it was made as a tool to use for scheduling whilst developing 'Of the Sky' as we hade to develop the game at distance. But then I wanted to take it a bit further and release it for the public.",
            "p2" : "The bot's main functionality at this time is setting and storing the time zone of the channel it's in, and then adapting that time zone when the user calls the !sb-alarm function so that the bot can work from anywhere in the world.",
            "p3" : "I have a lot of plans for further functionality, including adding timers, adding alarms with specific time zones, adding daily/weekly/monthly/yearly alarms and much more. But for now I'm very happy with how it turned out."
        },
        "website" : "https://top.gg/bot/694152126359666728",
        "splash" : "images/schedulebone/splash.png",
        "screenshots" :
        {
            "01" : "images/schedulebone/screen_01.png",
            "02" : "images/schedulebone/screen_02.png",
            "03" : "images/schedulebone/screen_03.png"
        },
        "specs" :
        {
            "duration" : "Ongoing",
            "engine" : "Node.js (Discord.js)",
            "language" : "JavaScript",
            "platform" : "Discord"
        },
        "extra" : "<a target='_blank' href='https://top.gg/bot/694152126359666728'><img src='https://top.gg/api/widget/694152126359666728.svg' alt='ScheduleBone' /></a>"
    }
]